SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_lcd.h
/* Bit fields for LCD BACTRL */
#define _LCD_BACTRL_RESETVALUE               0x00000000UL                               /**< Default value for LCD_BACTRL                */
#define _LCD_BACTRL_MASK                     0x100003FFUL                               /**< Mask for LCD_BACTRL                         */
#define LCD_BACTRL_BLINKEN                   (0x1UL << 0)                               /**< Blink Enable                                */
#define _LCD_BACTRL_BLINKEN_SHIFT            0                                          /**< Shift value for LCD_BLINKEN                 */
#define _LCD_BACTRL_BLINKEN_MASK             0x1UL                                      /**< Bit mask for LCD_BLINKEN                    */
#define _LCD_BACTRL_BLINKEN_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define LCD_BACTRL_BLINKEN_DEFAULT           (_LCD_BACTRL_BLINKEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_BLANK                     (0x1UL << 1)                               /**< Blank Display                               */
#define _LCD_BACTRL_BLANK_SHIFT              1                                          /**< Shift value for LCD_BLANK                   */
#define _LCD_BACTRL_BLANK_MASK               0x2UL                                      /**< Bit mask for LCD_BLANK                      */
#define _LCD_BACTRL_BLANK_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_BLANK_DISABLE            0x00000000UL                               /**< Mode DISABLE for LCD_BACTRL                 */
#define _LCD_BACTRL_BLANK_ENABLE             0x00000001UL                               /**< Mode ENABLE for LCD_BACTRL                  */
#define LCD_BACTRL_BLANK_DEFAULT             (_LCD_BACTRL_BLANK_DEFAULT << 1)           /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_BLANK_DISABLE             (_LCD_BACTRL_BLANK_DISABLE << 1)           /**< Shifted mode DISABLE for LCD_BACTRL         */
#define LCD_BACTRL_BLANK_ENABLE              (_LCD_BACTRL_BLANK_ENABLE << 1)            /**< Shifted mode ENABLE for LCD_BACTRL          */
#define LCD_BACTRL_AEN                       (0x1UL << 2)                               /**< Animation Enable                            */
#define _LCD_BACTRL_AEN_SHIFT                2                                          /**< Shift value for LCD_AEN                     */
#define _LCD_BACTRL_AEN_MASK                 0x4UL                                      /**< Bit mask for LCD_AEN                        */
#define _LCD_BACTRL_AEN_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define LCD_BACTRL_AEN_DEFAULT               (_LCD_BACTRL_AEN_DEFAULT << 2)             /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define _LCD_BACTRL_AREGASC_SHIFT            3                                          /**< Shift value for LCD_AREGASC                 */
#define _LCD_BACTRL_AREGASC_MASK             0x18UL                                     /**< Bit mask for LCD_AREGASC                    */
#define _LCD_BACTRL_AREGASC_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_AREGASC_NOSHIFT          0x00000000UL                               /**< Mode NOSHIFT for LCD_BACTRL                 */
#define _LCD_BACTRL_AREGASC_SHIFTLEFT        0x00000001UL                               /**< Mode SHIFTLEFT for LCD_BACTRL               */
#define _LCD_BACTRL_AREGASC_SHIFTRIGHT       0x00000002UL                               /**< Mode SHIFTRIGHT for LCD_BACTRL              */
#define LCD_BACTRL_AREGASC_DEFAULT           (_LCD_BACTRL_AREGASC_DEFAULT << 3)         /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_AREGASC_NOSHIFT           (_LCD_BACTRL_AREGASC_NOSHIFT << 3)         /**< Shifted mode NOSHIFT for LCD_BACTRL         */
#define LCD_BACTRL_AREGASC_SHIFTLEFT         (_LCD_BACTRL_AREGASC_SHIFTLEFT << 3)       /**< Shifted mode SHIFTLEFT for LCD_BACTRL       */
#define LCD_BACTRL_AREGASC_SHIFTRIGHT        (_LCD_BACTRL_AREGASC_SHIFTRIGHT << 3)      /**< Shifted mode SHIFTRIGHT for LCD_BACTRL      */
#define _LCD_BACTRL_AREGBSC_SHIFT            5                                          /**< Shift value for LCD_AREGBSC                 */
#define _LCD_BACTRL_AREGBSC_MASK             0x60UL                                     /**< Bit mask for LCD_AREGBSC                    */
#define _LCD_BACTRL_AREGBSC_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_AREGBSC_NOSHIFT          0x00000000UL                               /**< Mode NOSHIFT for LCD_BACTRL                 */
#define _LCD_BACTRL_AREGBSC_SHIFTLEFT        0x00000001UL                               /**< Mode SHIFTLEFT for LCD_BACTRL               */
#define _LCD_BACTRL_AREGBSC_SHIFTRIGHT       0x00000002UL                               /**< Mode SHIFTRIGHT for LCD_BACTRL              */
#define LCD_BACTRL_AREGBSC_DEFAULT           (_LCD_BACTRL_AREGBSC_DEFAULT << 5)         /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_AREGBSC_NOSHIFT           (_LCD_BACTRL_AREGBSC_NOSHIFT << 5)         /**< Shifted mode NOSHIFT for LCD_BACTRL         */
#define LCD_BACTRL_AREGBSC_SHIFTLEFT         (_LCD_BACTRL_AREGBSC_SHIFTLEFT << 5)       /**< Shifted mode SHIFTLEFT for LCD_BACTRL       */
#define LCD_BACTRL_AREGBSC_SHIFTRIGHT        (_LCD_BACTRL_AREGBSC_SHIFTRIGHT << 5)      /**< Shifted mode SHIFTRIGHT for LCD_BACTRL      */
#define LCD_BACTRL_ALOGSEL                   (0x1UL << 7)                               /**< Animate Logic Function Select               */
#define _LCD_BACTRL_ALOGSEL_SHIFT            7                                          /**< Shift value for LCD_ALOGSEL                 */
#define _LCD_BACTRL_ALOGSEL_MASK             0x80UL                                     /**< Bit mask for LCD_ALOGSEL                    */
#define _LCD_BACTRL_ALOGSEL_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_ALOGSEL_AND              0x00000000UL                               /**< Mode AND for LCD_BACTRL                     */
#define _LCD_BACTRL_ALOGSEL_OR               0x00000001UL                               /**< Mode OR for LCD_BACTRL                      */
#define LCD_BACTRL_ALOGSEL_DEFAULT           (_LCD_BACTRL_ALOGSEL_DEFAULT << 7)         /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_ALOGSEL_AND               (_LCD_BACTRL_ALOGSEL_AND << 7)             /**< Shifted mode AND for LCD_BACTRL             */
#define LCD_BACTRL_ALOGSEL_OR                (_LCD_BACTRL_ALOGSEL_OR << 7)              /**< Shifted mode OR for LCD_BACTRL              */
#define LCD_BACTRL_FCEN                      (0x1UL << 8)                               /**< Frame Counter Enable                        */
#define _LCD_BACTRL_FCEN_SHIFT               8                                          /**< Shift value for LCD_FCEN                    */
#define _LCD_BACTRL_FCEN_MASK                0x100UL                                    /**< Bit mask for LCD_FCEN                       */
#define _LCD_BACTRL_FCEN_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define LCD_BACTRL_FCEN_DEFAULT              (_LCD_BACTRL_FCEN_DEFAULT << 8)            /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_DISPLAYCNTEN              (0x1UL << 9)                               /**< Display Counter Enable                      */
#define _LCD_BACTRL_DISPLAYCNTEN_SHIFT       9                                          /**< Shift value for LCD_DISPLAYCNTEN            */
#define _LCD_BACTRL_DISPLAYCNTEN_MASK        0x200UL                                    /**< Bit mask for LCD_DISPLAYCNTEN               */
#define _LCD_BACTRL_DISPLAYCNTEN_DEFAULT     0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_DISPLAYCNTEN_DISABLE     0x00000000UL                               /**< Mode DISABLE for LCD_BACTRL                 */
#define _LCD_BACTRL_DISPLAYCNTEN_ENABLE      0x00000001UL                               /**< Mode ENABLE for LCD_BACTRL                  */
#define LCD_BACTRL_DISPLAYCNTEN_DEFAULT      (_LCD_BACTRL_DISPLAYCNTEN_DEFAULT << 9)    /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_DISPLAYCNTEN_DISABLE      (_LCD_BACTRL_DISPLAYCNTEN_DISABLE << 9)    /**< Shifted mode DISABLE for LCD_BACTRL         */
#define LCD_BACTRL_DISPLAYCNTEN_ENABLE       (_LCD_BACTRL_DISPLAYCNTEN_ENABLE << 9)     /**< Shifted mode ENABLE for LCD_BACTRL          */
#define LCD_BACTRL_ALOC                      (0x1UL << 28)                              /**< Animation Location                          */
#define _LCD_BACTRL_ALOC_SHIFT               28                                         /**< Shift value for LCD_ALOC                    */
#define _LCD_BACTRL_ALOC_MASK                0x10000000UL                               /**< Bit mask for LCD_ALOC                       */
#define _LCD_BACTRL_ALOC_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_BACTRL                 */
#define _LCD_BACTRL_ALOC_SEG0TO7             0x00000000UL                               /**< Mode SEG0TO7 for LCD_BACTRL                 */
#define _LCD_BACTRL_ALOC_SEG8TO15            0x00000001UL                               /**< Mode SEG8TO15 for LCD_BACTRL                */
#define LCD_BACTRL_ALOC_DEFAULT              (_LCD_BACTRL_ALOC_DEFAULT << 28)           /**< Shifted mode DEFAULT for LCD_BACTRL         */
#define LCD_BACTRL_ALOC_SEG0TO7              (_LCD_BACTRL_ALOC_SEG0TO7 << 28)           /**< Shifted mode SEG0TO7 for LCD_BACTRL         */
#define LCD_BACTRL_ALOC_SEG8TO15             (_LCD_BACTRL_ALOC_SEG8TO15 << 28)          /**< Shifted mode SEG8TO15 for LCD_BACTRL        */

/* Bit fields for LCD STATUS */
#define _LCD_STATUS_RESETVALUE               0x00000000UL                               /**< Default value for LCD_STATUS                */
#define _LCD_STATUS_MASK                     0x0000090FUL                               /**< Mask for LCD_STATUS                         */
#define _LCD_STATUS_ASTATE_SHIFT             0                                          /**< Shift value for LCD_ASTATE                  */
#define _LCD_STATUS_ASTATE_MASK              0xFUL                                      /**< Bit mask for LCD_ASTATE                     */
#define _LCD_STATUS_ASTATE_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LCD_STATUS                 */
#define LCD_STATUS_ASTATE_DEFAULT            (_LCD_STATUS_ASTATE_DEFAULT << 0)          /**< Shifted mode DEFAULT for LCD_STATUS         */
#define LCD_STATUS_BLINK                     (0x1UL << 8)                               /**< Blink State                                 */
#define _LCD_STATUS_BLINK_SHIFT              8                                          /**< Shift value for LCD_BLINK                   */
#define _LCD_STATUS_BLINK_MASK               0x100UL                                    /**< Bit mask for LCD_BLINK                      */
#define _LCD_STATUS_BLINK_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LCD_STATUS                 */
#define LCD_STATUS_BLINK_DEFAULT             (_LCD_STATUS_BLINK_DEFAULT << 8)           /**< Shifted mode DEFAULT for LCD_STATUS         */
#define LCD_STATUS_LOADBUSY                  (0x1UL << 11)                              /**< Load Synchronization is busy                */
#define _LCD_STATUS_LOADBUSY_SHIFT           11                                         /**< Shift value for LCD_LOADBUSY                */
#define _LCD_STATUS_LOADBUSY_MASK            0x800UL                                    /**< Bit mask for LCD_LOADBUSY                   */
#define _LCD_STATUS_LOADBUSY_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LCD_STATUS                 */
#define LCD_STATUS_LOADBUSY_DEFAULT          (_LCD_STATUS_LOADBUSY_DEFAULT << 11)       /**< Shifted mode DEFAULT for LCD_STATUS         */

/* Bit fields for LCD AREGA */
#define _LCD_AREGA_RESETVALUE                0x00000000UL                               /**< Default value for LCD_AREGA                 */
#define _LCD_AREGA_MASK                      0x000000FFUL                               /**< Mask for LCD_AREGA                          */
#define _LCD_AREGA_AREGA_SHIFT               0                                          /**< Shift value for LCD_AREGA                   */
#define _LCD_AREGA_AREGA_MASK                0xFFUL                                     /**< Bit mask for LCD_AREGA                      */
#define _LCD_AREGA_AREGA_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_AREGA                  */
#define LCD_AREGA_AREGA_DEFAULT              (_LCD_AREGA_AREGA_DEFAULT << 0)            /**< Shifted mode DEFAULT for LCD_AREGA          */

/* Bit fields for LCD AREGB */
#define _LCD_AREGB_RESETVALUE                0x00000000UL                               /**< Default value for LCD_AREGB                 */
#define _LCD_AREGB_MASK                      0x000000FFUL                               /**< Mask for LCD_AREGB                          */
#define _LCD_AREGB_AREGB_SHIFT               0                                          /**< Shift value for LCD_AREGB                   */
#define _LCD_AREGB_AREGB_MASK                0xFFUL                                     /**< Bit mask for LCD_AREGB                      */
#define _LCD_AREGB_AREGB_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_AREGB                  */
#define LCD_AREGB_AREGB_DEFAULT              (_LCD_AREGB_AREGB_DEFAULT << 0)            /**< Shifted mode DEFAULT for LCD_AREGB          */

/* Bit fields for LCD IF */
#define _LCD_IF_RESETVALUE                   0x00000000UL                               /**< Default value for LCD_IF                    */
#define _LCD_IF_MASK                         0x00000007UL                               /**< Mask for LCD_IF                             */
#define LCD_IF_FC                            (0x1UL << 0)                               /**< Frame Counter                               */
#define _LCD_IF_FC_SHIFT                     0                                          /**< Shift value for LCD_FC                      */
#define _LCD_IF_FC_MASK                      0x1UL                                      /**< Bit mask for LCD_FC                         */
#define _LCD_IF_FC_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for LCD_IF                     */
#define LCD_IF_FC_DEFAULT                    (_LCD_IF_FC_DEFAULT << 0)                  /**< Shifted mode DEFAULT for LCD_IF             */
#define LCD_IF_DISPLAY                       (0x1UL << 1)                               /**< Display Update Event                        */
#define _LCD_IF_DISPLAY_SHIFT                1                                          /**< Shift value for LCD_DISPLAY                 */
#define _LCD_IF_DISPLAY_MASK                 0x2UL                                      /**< Bit mask for LCD_DISPLAY                    */
#define _LCD_IF_DISPLAY_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for LCD_IF                     */
#define LCD_IF_DISPLAY_DEFAULT               (_LCD_IF_DISPLAY_DEFAULT << 1)             /**< Shifted mode DEFAULT for LCD_IF             */
#define LCD_IF_SYNCBUSYDONE                  (0x1UL << 2)                               /**< Synchronization is Done                     */
#define _LCD_IF_SYNCBUSYDONE_SHIFT           2                                          /**< Shift value for LCD_SYNCBUSYDONE            */
#define _LCD_IF_SYNCBUSYDONE_MASK            0x4UL                                      /**< Bit mask for LCD_SYNCBUSYDONE               */
#define _LCD_IF_SYNCBUSYDONE_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LCD_IF                     */
#define LCD_IF_SYNCBUSYDONE_DEFAULT          (_LCD_IF_SYNCBUSYDONE_DEFAULT << 2)        /**< Shifted mode DEFAULT for LCD_IF             */

